[
  {
    "slug": "make-me-feel-alright",
    "blurb": "My first album. Late-night self-therapy turned into spacey, honest songs.",
    "sections": [
      {
        "section-title": "Story",
        "body": "This whole music thing kind of came together by accident. I had a couple songs already lying around – *Liftoff* and *Lucky Break* started as instrumentals I just put up onto YouTube for fun. At some point I thought, “why not throw some lyrics over these?” and that was basically the spark. From there, whenever I felt like crap, usually late at night, I just opened up Logic and spit out whatever was in my head. At the time, I was in a pretty weird spot in life: stuck in the last part of school, just had to repeat a year, didn’t know that many people in my new class. Music ended up being where I poured all of that."
      },
      {
        "section-title": "Writing & Themes",
        "body": "The songs are all super personal, even if they don’t always sound that way. *Liftoff* is kinda leaning on the story of *Romeo and Juliet*. *Make Me Feel Alright* was about my ex, *Ocean*, well I think that one's obvious, and *Lucky Break* was trying to process a kind of imposter feeling I sometimes struggled with. There wasn’t a grand plan or a concept, it was just me making songs whenever I felt like I had to, and then realizing at some point that they actually worked together as an album."
      },
      {
        "section-title": "Production",
        "body": "I made everything in Logic, mostly finding an interesting loop and building something around that. I leaned hard on reverb and arpeggiators, which gave the whole project this space-y, 80s kind of vibe. Around then, I was listening to a lot of Grimes, and while I wasn’t copying her, the way she used arps definitely lined up with what I was doing. Honestly, using arps just made it easier to build melodies that felt alive. The sound is definitely rough around the edges sometimes, but I think that’s also what gives it character."
      },
      {
        "section-title": "Looking Back",
        "body": "For me, *Make Me Feel Alright* is the perfect snapshot of that period. It’s raw, a bit messy, emotional, but it’s real. If there’s one thing I’d change though, it would be the mix and mastering. Back then, I just threw Logic’s built-in mastering assistant on everything and called it a day. But even with the roughness, I think it holds up. *Liftoff* especially still feels like such a strong opener that I’ve even thought about doing something more with it. As a first album, it couldn’t have been a better starting point: maybe a bit unpolished, but honest, and definitely the beginning of everything I’ve built since."
      }
    ]
  },
  {
    "slug": "imagination",
    "blurb": "A quick follow-up where I chased bigger sounds and daydreamed out loud.",
    "sections": [
      {
        "section-title": "Story",
        "body": "By the time I put this one together, life looked really different from when I made *Make Me Feel Alright*. I was more settled in, had a friend group, knew people from house parties and park evenings, and felt way more comfortable in my environment. Funny enough, I actually got along better with the girls in my grade than the guys, but either way, I finally felt like I belonged somewhere. Still, I had those nights where everything caught up with me and I just needed music as therapy again.\n\nThis album started as another collection of songs, but this time I knew I wanted it to become a project. Once I had seven tracks, I said, “alright, that’s the album,” and locked it in. Interestingly, the first song I wrote for it was *Record Deals*, which ended up as the last track on the final version. The overall mood wasn’t super different from the first album; still personal, still me working through those late-night emotions, but I definitely wanted to make it sound a bit more “normal,” a little closer to mainstream pop than my first one."
      },
      {
        "section-title": "The Quick Infatuation Swap",
        "body": "One of the biggest last-minute moves I made was with *Quick Infatuation*. Originally it was a completely different song with a totally different production. The problem was: the key sat right in the dead spot of my vocal range, so no matter how I sang it, it didn’t work, and when I tried to change the key, it didn’t sound right anymore. Instead of pushing through, I panicked because I’d already set myself a release date for August 1st, so I scrapped the original version and built a new song from scratch only two weeks before release. I’ve regretted it ever since. The lyrics weren’t fleshed out, and it just doesn’t hit the way the original did. At some point, I’ll definitely drop the real *Quick Infatuation* on like a “The Vault” release, because that version was really good."
      },
      {
        "section-title": "Writing & Themes",
        "body": "Like the first album, this one was therapy for me. Most songs tie back to real events or people, the title track *Imagination* especially, which I wrote about a girl I wasn’t sure was into me. In my head, I thought dropping the song would make her come up to me and say, “yeah, I like you too.” Spoiler: that never happened. But at the time, it felt like I was shooting my shot in my own way. The rest of the album was me trying to balance that deeply personal writing with the idea of making music that felt more accessible."
      },
      {
        "section-title": "Production",
        "body": "Sound-wise, it’s pretty close to *Make Me Feel Alright* because I started it almost immediately after finishing that one. I still used Logic with loops as a base, leaned on reverb, and aimed for atmosphere. But I did learn from the first project, so the production here is at least a little tighter. I still used the mastering assistant, but I tried to do more proper mixing. Overall, though, both albums live in the same universe – which makes sense, since they’re only about four months apart. One influence that snuck in was Avicii. *Record Deals* was basically my “what if I made something like *Levels*” experiment. It didn’t end up being the next *Levels* (thanks to me not doing any marketing for the album), but at least the ambition was there."
      },
      {
        "section-title": "Looking Back",
        "body": "I don’t think *Imagination* is as strong as *Make Me Feel Alright*. It’s less cohesive and feels more like seven different songs and genres mashed together, even more than MMFA. But I think you can still hear the progression, the mixing’s a bit better, the production more confident, and it shows I was starting to think about what kind of artist I wanted to be. If I could fix one thing, it’d definitely be the mix and master, like in *Make Me Feel Alright* . Still, for all its flaws, it’s part of my story, and it shows that hunger to just keep going, keep releasing, and keep figuring myself out"
      }
    ]
  },
  {
    "slug": "break-it-down",
    "blurb": "A banger track I almost scrapped but ended up loving.",
    "sections": [
      {
        "section-title": "Story",
        "body": "This track comes from the same era as *Spacewalk*. If I hadn’t leaned into the whole narrative arc on that album, *Break It Down* probably would’ve ended up on there. It shares a lot of the same DNA, but it didn’t fit the bigger story, so I decided to put it out on its own. At the time, *Spacewalk* was stuck in limbo with a sample clearance issue, and I didn’t want months of silence. So I thought: why not drop this one now, keep the momentum going, and drop *Spacewalk* later?"
      },
      {
        "section-title": "Writing & Production",
        "body": "*Break It Down* is built around a really distinct beat loop. From the second I found it, I knew it had the kind of bounce that makes a track unique. The only lyric is the sample looping over and over, which gives it this “earwormy”, classic house drive. Simple, but effective, and honestly, it bangs. It’s got that “summer anthem” kind of energy, and if I had pushed it harder with promo, I could totally imagine it popping off in that way."
      },
      {
        "section-title": "Mixing & Mastering",
        "body": "The release almost didn’t happen. Back then, I was still relying on Logic’s mastering assistant, and the first bounces sounded awful. The sharp lead synth in the chorus cut through the mix in the worst way, and I just couldn’t figure out how to solve it. I was close to shelving it. Then I tried out Ozone 11 for the first time, and honestly, it saved the song. Ozone pulled everything together, smoothed out the harshness, and made it sound like a real, finished record. That moment was a game-changer, like, “oh wow, my tracks can actually sound professional now.”"
      },
      {
        "section-title": "Release",
        "body": "After the mix finally clicked, I decided to go for it. It had been eight months since *Imagination*, and that silence felt way too long. Dropping *Break It Down* as a standalone single on April 1st just made sense. I wanted to show that I was capable of way more than what I did back in the first two albums. Maybe it came a little unexpected, but it was a way of saying, “I’m still here, still making stuff.”"
      },
      {
        "section-title": "Looking Back",
        "body": "*Break It Down* is a clean little snapshot of that transitional phase. It’s got the electronic energy of *Spacewalk*, but it sits nicely on its own. For me, it’s also tied to that “aha” moment of discovering Ozone and realizing how much the right tools could lift my sound. It wasn’t part of a bigger plan, but sometimes those are the tracks that hit the hardest."
      }
    ]
  },
  {
    "slug": "spacewalk",
    "blurb": "A wordless, cinematic trip through space inspired by Interstellar.",
    "sections": [
      {
        "section-title": "Story",
        "body": "By the time I started *Spacewalk*, life had shifted again. In September 2024 I moved out to study in another city, into a shared apartment. The walls were thin, and singing felt awkward because I knew everyone could hear me, so I leaned into instrumentals instead. That’s how this whole project was born: an electronic, wordless album.\n\nI’d always liked house and techno, but I never really nailed the sound before. With *Spacewalk*, I finally felt like I was figuring it out, making tracks that actually sounded how I wanted them to. At first, it wasn’t a concept album at all, just a bunch of electronic songs. But when I started naming them, I realized they could fit into a bigger arc. That’s when the idea of making it a kind of *Interstellar*-inspired journey developed."
      },
      {
        "section-title": "Writing & Themes",
        "body": "The album tells the story of a space mission. It starts with wonder and discovery, but gradually shifts into chaos and loss. *Nocturne* and *Mirage* are wide-eyed, gazing out into the stars. *Spacewalk* is a bit more dynamic, in a movie this track would be played over like a montage or something. *Disturbance* sprinkles in a little tension in between, that strangeness of space creeping in. Then, something goes wrong in *Breach*, the mission collapses and communication breaks down. Lost Signal then has the vibe of being stranded in space, everyone else millions of miles away. Finally, *Detach* closes it all with sacrifice: one person letting go, so the other can survive.\n\nIt’s a narrative, but the songs also stand on their own. Each track has a distinct personality, its own sound design, but together they tell this cinematic arc. I wanted it to feel like a continuous piece, something you could just close your eyes to and drift away with."
      },
      {
        "section-title": "Production",
        "body": "If there’s one thing this project taught me, it’s to get way more creative with synths. Every track has some unique element, a texture or sound, that makes it stand out. Compared to my vocal albums, this was pure experimentation: I wasn’t worried about structure as much, I was just doing what felt right.\n\nOne big story here is *Lost Signal*. Originally, it had a sample from Goldfrapp’s *Lovely Head*, specifically that whistling intro. It fit so perfectly that I built the track around it. By February 2025, the album was basically done, but I wanted to try to clear the sample properly. I reached out to the rights holders, but never got a reply. In July, after months of waiting and hearing nothing back, I realized I had to move on. By then, it was already cutting close to the release of *Born For More*.\n\nSo I reworked it. I scrapped the Goldfrapp sample, made my own whistling melody with a similar vibe, and rebuilt the track from there. The DNA of the original inspiration is still in there, but now it’s mine. It delayed the release by months, but at least I got the album out without worrying about copyright."
      },
      {
        "section-title": "Looking Back",
        "body": "I see *Spacewalk* as a turning point. It showed me I could make electronic music that actually worked, and it gave me confidence with sound design in a way my vocal albums didn’t. If there’s one thing I’d change, it’s the reliance on drum loops. I still haven’t dug into making the drums myself, which is definitely a bit lazy. But honestly, if it helps me realize the vision of the song, and it sounds good – why not use them?\n\nEven though it came out so close to *Born For More*, and I didn’t really do any promo for it, I don’t regret releasing it. It’s its own universe, a cinematic little voyage, and it captures exactly what I wanted: that feeling of drifting through space, somewhere between wonder and loneliness."
      }
    ]
  },
  {
    "slug": "born-for-more",
    "blurb": "Coming Oct 1st. My magnum opus. A story about fame, ego, and collapse.",
    "sections": [
      {
        "section-title": "Story",
        "body": "This is the project I’ve been building toward. *Born For More* didn’t start as a grand plan — the first songs were just beats, sketches, experiments. But somewhere along the way, a story revealed itself. The more I worked, the clearer it became: this album wasn’t just a collection of tracks, it was going to be a full arc — from ambition and innocence, through fame and success, to collapse and ego.\n\nIt’s my first true concept album. Fourteen songs, each part of a larger journey. Some tracks existed before the vision took shape, others were written specifically to fill the story’s gaps. Together, they form something much bigger than what I’ve done before."
      },
      {
        "section-title": "Writing & Themes",
        "body": "The album follows a character who starts out wide-eyed and hopeful, then spirals as he climbs higher. The early tracks are closest to me, written from real thoughts and experiences, while the later ones step into fiction — darker, exaggerated, more chaotic. The narrative isn’t autobiographical, but it pulls from real emotions.\n\nAt its core, *Born For More* is about ambition and its price. The desire to make it big, the rush of success, and the fallout that comes with it. Some songs are celebratory, others are stripped bare, some are just unhinged — but together, they tell one story."
      },
      {
        "section-title": "Production",
        "body": "Sound-wise, this is the biggest, boldest record I’ve made. It spans from acoustic and intimate to massive, stadium-ready anthems. There are experimental detours, electronic left turns, and moments of calm space in between. I’ve taken everything I’ve learned from my past projects and pushed it further.\n\nInfluences show up here and there — Kanye’s ambition, 90s rap grit, even flashes of The Prodigy’s chaos — but at the end of the day, it sounds like me. Every track has its own world, but they’re all tied together by the narrative thread."
      },
      {
        "section-title": "Looking Ahead",
        "body": "*Born For More* is easily my most ambitious project to date. It’s not just an album — it’s a story, a rise-and-fall journey that’s bigger and bolder than anything I’ve done before. Some of it is me, some of it is fiction, but all of it feels true.\n\n**October 1st is when it drops.** Until then, all I’ll say is this: every song has its place, and the story only makes sense when you hear it all the way through."
      }
    ]
  }
]